{
    "showapi_res_error": "",
    "showapi_res_id": "646d0f070de376532f2fe723",
    "showapi_res_code": 0,
    "showapi_fee_num": 1,
    "showapi_res_body": {
      "ret_code": 0,
      "pb": {
        "contentlist": [
    {
"title": "What is the main source of water for drinking?",
"answer": "Tap water"
},
{
"title": "Which gas is responsible for global warming?",
"answer": "Carbon dioxide"
},
{
"title": "What is the process of converting liquid water into vapor called?",
"answer": "Evaporation"
},
{
"title": "What is the largest source of marine pollution?",
"answer": "Plastic"
},
{
"title": "What is the primary cause of ozone depletion?",
"answer": "Chlorofluorocarbons (CFCs)"
},
{
"title": "What is the process of plants releasing water vapor called?",
"answer": "Transpiration"
},
{
"title": "What is the term for the gradual increase in the Earth's average temperature?",
"answer": "Global warming"
},
{
"title": "Which renewable energy source utilizes the sun's energy?",
"answer": "Solar power"
},
{
"title": "What is the primary greenhouse gas emitted by human activities?",
"answer": "Carbon dioxide"
},
{
"title": "What is the largest rainforest in the world?",
"answer": "Amazon rainforest"
},
{
"title": "What is the process of water droplets forming on a cold surface called?",
"answer": "Condensation"
},
{
"title": "Which gas makes up the majority of Earth's atmosphere?",
"answer": "Nitrogen"
},
{
"title": "What is the primary cause of water pollution in rivers and lakes?",
"answer": "Industrial waste"
},
{
"title": "What is the term for the gradual rise in sea levels?",
"answer": "Sea level rise"
},
{
"title": "Which energy-efficient light bulbs consume less energy than traditional incandescent bulbs?",
"answer": "LED bulbs"
},
{
"title": "What is the process of breaking down waste materials by bacteria called?",
"answer": "Decomposition"
},
{
"title": "What is the process of converting sunlight into usable energy called?",
"answer": "Photosynthesis"
},
{
"title": "What is the term for the loss of a species from a particular habitat or the entire planet?",
"answer": "Extinction"
},
{
"title": "Which gas is responsible for the unpleasant smell of rotten eggs?",
"answer": "Hydrogen sulfide"
},
{
"title": "What is the largest ocean in the world?",
"answer": "Pacific Ocean"
},
{
"title": "What is the process of filtering water through a porous substance called?",
"answer": "Filtration"
},
{
"title": "Which natural disaster is caused by a sudden shaking of the Earth's surface?",
"answer": "Earthquake"
},
{
"title": "What is the primary cause of air pollution in urban areas?",
"answer": "Vehicle emissions"
},
{
"title": "What is the term for the process of turning waste materials into reusable materials?",
"answer": "Recycling"
},
{
"title": "What is the main greenhouse gas produced by the agricultural sector?",
"answer": "Methane"
},
{
"title": "What is the term for the excessive cutting down of trees?",
"answer": "Deforestation"
},
{
"title": "What is the process of water seeping into the ground called?",
"answer": "Infiltration"
},
{
"title": "Which gas is necessary for all living organisms to breathe?",
"answer": "Oxygen"
},
{
"title": "What is the primary cause of soil erosion?",
"answer": "Water and wind"
},
{
"title": "What is the term for the accumulation of harmful substances in the tissues of living organisms?",
"answer": "Bioaccumulation"
}
         
        ],
        "maxResult": 20,
        "allNum": 936,
        "allPages": 47,
        "currentPage": 1
      }
    }
  }
